Repository: ASMfreaK/habitipy
Catalog: habitipy/i18n/*.po
Languages: ru

source: Got return code {res.status}, but {node.retcode} was expected for {node.uri}. It may be a typo in Habitica apiDoc. Please file an issue to https://github.com/HabitRPG/habitica/issues
ru: Получен код {res.status}, но {node.retcode} ожидался ожидался при запросе {node.uri}. Возможно, это ошибка в документации на API Хабитики. Пожалуйста, напишите об этом на сайт https://github.com/HabitRPG/habitica/issues

source: warrior
ru: воин

source: rogue
ru: вор

source: wizard
ru: волшебник

source: healer
ru: лекарь

source: Your credentials are invalid. Do you want to enter them now?
ru: Персональные данные доступа не настроены. Хотите настроить сейчас?

source: You can get your login information at https://habitica.com/#/options/settings/api Both your user id and API token should look like this: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx where 'x' is a number between 0-9 or a character a-f.
ru: Вы можете получить персональные данные доступа на странице https://habitica.com/#/options/settings/api Ваши ID пользователя и токен API должня выглядеть следующим образом: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx где 'x' - число от 0 до 9 или буква a-f.

source: Please enter your login (user ID)
ru: Пожалуйста, введите свой логин (ID пользователя)

source: Please enter your password (API token)
ru: Пожалуйта, введите ваш пароль (токен API)

source: Your credentials are securely stored in {configfile} You can edit that file later if you need.
ru: Ваши персональные данные доступа безопасно сохранены в файл {configfile} Вы можете отредактировать его позже, если это необходимо.

source: Use file CONFIG for config
ru: Использовать CONFIG для конфигурации

source: Verbose output - log everything.
ru: Полный вывод всех сообщений.

source: Make program more silent
ru: Программа будет выводить меньше сообщений

source: tools and library for Habitica restful API
ru: инструменты и библиотека для Habitica REST-полного API

source: No subcommand given, exiting
ru: Подкомманда не дана, выход

source: Show HP, XP, GP, and more
ru: Показать очки здоровья, опыта, золота и многое другое

source: Pet:
ru: Питомец:

source: No pet
ru: Питомец не выбран

source: Mount:
ru: Ездовое животное:

source: No mount
ru: Ездовое животное не выбрано

source: Level {stats[lvl]} {stats[class]}
ru: Уровень {stats[lvl]} {stats[class]}

source: Health: {stats[hp]}/{stats[maxHealth]}
ru: Здоровье: {stats[hp]}/{stats[maxHealth]}

source: XP: {stats[exp]}/{stats[toNextLevel]}
ru: Опыт: {stats[exp]}/{stats[toNextLevel]}

source: Mana: {stats[mp]}/{stats[maxMP]}
ru: Мана: {stats[mp]}/{stats[maxMP]}

source: GP: {stats[gp]:.2f}
ru: ЗМ: {stats[gp]:.2f}

source: ({food} food item)
ru: ({food} единица еды)

source: Quest {} not found in Habitica's content. Please file an issue to https://github.com/ASMfreaK/habitipy/issues
ru: Квест {} не найден в контенте Habitica. Пожалуйста, отправьте issue на https://github.com/ASMfreaK/habitipy/issues

source: Quest: {quest[text]} (collect-type) {user[party][quest][progress][collectedItems]} quest items collected
ru: Квест: {quest[text]} (сбор предметов) Собрано квестовых предметов {user[party][quest][progress][collectedItems]}

source: Quest: {quest[text]} (boss) {user[party][quest][progress][up]:.1f} damage will be dealt to {quest[boss][name]}
ru: Квест: {quest[text]} (босс-квест) {user[party][quest][progress][up]:.1f} урона будет нанесено боссу {quest[boss][name]}

source: Something went wrong when formatting quest {}. Please file an issue to https://github.com/ASMfreaK/habitipy/issues
ru: Произошла какая-то ошибка прм форматировании квеста {}. Пожалуйста, отправьте issue на https://github.com/ASMfreaK/habitipy/issues

source: Quest {} isn't neither a collect-type or a boss-type. Please file an issue to https://github.com/ASMfreaK/habitipy/issues
ru: Квест {} - это ни квест на сбор предметов ни на бой с боссом. Пожалуйста, отправьте issue на https://github.com/ASMfreaK/habitipy/issues

source: List, up and down habit tasks
ru: Отобразить, улучшить или ухудшить привычку

source: List, check, uncheck daily tasks
ru: Отобразить ежедвневные задания, отметить или снять отметку на них

source: List, comlete, add or delete todo tasks
ru: Отобразить, завершить, добавить или удалить задание

source: List, buy and add rewards
ru: Отобразить, купить или добавить награду

source: {value} gp
ru: {value} зм

source: If passed, won't actually change anything on habitipy server
ru: Если опция предоставлена, то данная команда не будет изменять данные на сервере Хабитики

source: No task_ids found!
ru: Идентификаторы задания не найдены!

source: Task id {} is invalid
ru: Идентификатор задания {} неверный

source: Parsed task ids {}
ru: Распознаны следующие идентификаторы заданий {}

source: Add a habit <habit>
ru: Добавить привычку <habit>

source: Priority (complexity) of a habit
ru: Сложность (приоритет) привычки

source: positive/negative/both
ru: позитивная/негативная/оба варианта

source: Empty habit text!
ru: Пустой текст привычки!

source: Added habit '{}' with priority {} and direction {}
ru: Добавлена привычка '{}' со сложностью {} и направлением {}

source: Delete a habit with task_id
ru: Удалить привычку с индентификатором task_id

source: Deleted habit {text}
ru: Привычка {text} удалена

source: Up (+) a habit with task_id
ru: Улучшить (+) привычку с индентификатором task_id

source: Incremented habit {text}
ru: Привычка {text} улучшена

source: Down (-) a habit with task_id
ru: Ухудшить (-) привычку с индентификатором task_id

source: Decremented habit {text}
ru: Привычка {text} ухудшена

source: Check a dayly with task_id
ru: Отметить ежедневное задание с идентификатором task_id

source: Completed daily {text}
ru: Отмечено ежедневное задание {text}

source: Uncheck a daily with task_id
ru: Снять отметку у ежедневного задания с идентификатором task_id

source: Unchecked daily {text}
ru: Снята отметка у ежедневного задания {text}

source: Check a todo with task_id
ru: Завершить задание с идентификатором task_id

source: Completed todo {text}
ru: Завершено задание {text}

source: Delete a todo with task_id
ru: Удалить задание с идентификатором task_id

source: Deleted todo {text}
ru: Удалено задание {text}

source: Add a todo <todo>
ru: Добавить задачу <todo>

source: Priority (complexity) of a todo
ru: Сложность (приоритет) задания

source: Empty todo text!
ru: Пустой текст задания!

source: Added todo '{}' with priority {}
ru: Добавлено задание '{}' со сложностью {}

source: Buy a reward with reward_id
ru: Купить награду с reward_id

source: No reward_ids found!
ru: Идентификаторы задания не найдены!

source: Reward id {} is invalid
ru: Идентификатор награды {} неверный

source: Parsed reward ids {}
ru: Распознаны следующие идентификаторы наград {}

source: Bought reward {text}
ru: Приобретена награда {text}

source: Add a reward <reward>
ru: Добавить награду <reward>

source: Cost of a reward (gp)
ru: Стоимость награды (зм)

source: Empty reward text!
ru: Пустой текст награды!

source: Added reward '{}' with cost {}
ru: Добавлена награда '{}' стоимостью {}

source: Open habitica site in browser
ru: Открыть сайт Хабитики в браузере

source: Opening {}
ru: Открываю {}

source: Check habitica server availability
ru: Проверить доступность сервера Хабитики

source: Habitica server {} online
ru: Сервер Хабитики {} доступен

source: Habitica server {} offline or there is some issue with it
ru: Сервер Хабитики {} не доступен или возникла какая-то ошибка

source: Prints all available spells
ru: Выводит на печать все доступные заклинания

source: Your level is too low. Come back on level 10 or higher
ru: Ваш уровень недостаточен. Возвращайтесь после 10 уровня

source: You are a {} of level {}
ru: Вы - {} {} уровня

source: Value {} is missing from api
ru: Значения {} нет в API

source: Got return code {res.status_code}, but {node.retcode} was expected for {node.uri}. It may be a typo in Habitica apiDoc. Please file an issue to https://github.com/HabitRPG/habitica/issues
ru: Получен код {res.status_code}, но {node.retcode} ожидался ожидался при запросе {node.uri}. Возможно, это ошибка в документации на API Хабитики. Пожалуйста, напишите об этом на сайт https://github.com/HabitRPG/habitica/issues

source: Wrong api url: {}
ru: Неправильная ссылка для API: {}
